podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/RTC_MK11D5WS.svd.xml
            <register>
               <name>TDR</name>
               <description>Tamper Detect Register</description>
               <addressOffset>0x34</addressOffset>
               <resetValue>0x1</resetValue>
               <fields>
                  <field>
                     <name>DTF</name>
                     <description>DryIce Tamper Flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Tamper not detected</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>DryIce tamper detected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VTF</name>
                     <description>Voltage Tamper Flag</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Tamper not detected</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Voltage tampering detected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CTF</name>
                     <description>Clock Tamper Flag</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Tamper not detected</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Clock tampering detected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TTF</name>
                     <description>Temperature Tamper Flag</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Tamper not detected</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Temperature tampering detected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FSF</name>
                     <description>Flash Security Flag</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Tamper not detected</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Flash security tamper detected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TMF</name>
                     <description>Test Mode Flag</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Tamper not detected</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Test mode tamper detected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TTR</name>
               <description>Tamper Trim Register</description>
               <addressOffset>0x38</addressOffset>
               <fields>
                  <field>
                     <name>VDTL</name>
                     <description>Voltage Detect Trim Low</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>VDTH</name>
                     <description>Voltage Detect Trim High</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>CDTL</name>
                     <description>Clock Detect Trim Low</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>CDTH</name>
                     <description>Clock Detect Trim High</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>TDTH</name>
                     <description>Temperature Detect Trim High</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>TDTL</name>
                     <description>Temperature Detect Trim Low</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIR</name>
               <description>Tamper Interrupt Register</description>
               <addressOffset>0x3C</addressOffset>
               <fields>
                  <field>
                     <name>DTIE</name>
                     <description>DryIce Tamper Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Interupt disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>An interrupt is generated when DryIce tamper flag is set</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VTIE</name>
                     <description>Voltage Tamper Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Interupt disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>An interrupt is generated when the voltage tamper flag is set</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CTIE</name>
                     <description>Clock Tamper Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Interupt disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>An interrupt is generated when the clock tamper flag is set</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TTIE</name>
                     <description>Temperature Tamper Interrupt Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Interupt disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>An interrupt is generated when the temperature tamper flag is set</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FSIE</name>
                     <description>Flash Security Interrupt Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Interupt disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>An interrupt is generated when the flash security flag is set</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TMIE</name>
                     <description>Test Mode Interrupt Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Interupt disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>An interrupt is generated when the test mode flag is set</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>WAR</name>
               <description>Write Access Register\n
Protects register against writes.  Any writes are ignored</description>
               <addressOffset>0x800</addressOffset>
               <resetValue>0xFF</resetValue>
               <fields>
                  <field>
                     <name>TSRW</name>
                     <description>Time Seconds Register Write Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Writes ignored</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Writes allowed</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="TSRW" > <name>TPRW</name> <description>Time Prescaler Register Write Enable</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="TSRW" > <name>TARW</name> <description>Time Alarm Register Write Enable</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="TSRW" > <name>TCRW</name> <description>Time Compensation Register Write Enable</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="TSRW" > <name>CRW</name> <description>Control Register Write Enable</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="TSRW" > <name>SRW</name> <description>Status Register Write Enable</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="TSRW" > <name>LRW</name> <description>Lock Register Write Enable</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="TSRW" > <name>IERW</name> <description>Interrupt Enable Register Write Enable</description> <bitOffset>7</bitOffset> </field>
                  <field>
                     <name>TTSW</name>
                     <description>Tamper Time Seconds Write</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Writes to the Tamper Time Seconds Register are ignored</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Writes to the Tamper Time Seconds Register complete as normal</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MERW</name>
                     <description>Monotonic Enable Register Write</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Writes to the Monotonic Enable Register are ignored</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Writes to the Monotonic Enable Register complete as normal</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MCLW</name>
                     <description>Monotonic Counter Low Write</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Writes to the Monotonic Counter Low Register are ignored</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Writes to the Monotonic Counter Low Register complete as normal</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MCHW</name>
                     <description>Monotonic Counter High Write</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Writes to the Monotonic Counter High Register are ignored</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Writes to the Monotonic Counter High Register complete as normal</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TERW</name>
                     <description>Tamper Enable Register Write</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Writes to the Tamper Enable Register are ignored</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Writes to the Tamper Enable Register complete as normal</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TDRW</name>
                     <description>Tamper Detect Register Write</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Writes to the Tamper Detect Register are ignored</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Writes to the Tamper Detect Register complete as normal</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TTRW</name>
                     <description>Tamper Trim Register Write</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Writes to the Tamper Trim Register are ignored</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Writes to the Tamper Trim Register complete as normal</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TIRW</name>
                     <description>Tamper Interrupt Register Write</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Writes to the Tamper Interrupt Register are ignored</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Writes to the Tamper Interrupt Register complete as normal</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
